Repository: BenjaminBriggs/sudoku-core
Catalog: Sources/SudokuCore/Localizable.xcstrings
Source language: en_gb
Languages: de, es, fr, ja, ko, zh_hans

source: Therefore, %lld can be eliminated from this cell.
de: Daher kann %lld aus dieser Zelle entfernt werden.
es: Por lo tanto, %lld puede eliminarse de esta celda.
fr: Donc, %lld peut être éliminé de cette case.
ja: したがって、このセルから%lldを除外できます。
ko: 따라서 이 칸에서 %lld을(를) 제거할 수 있습니다.
zh_hans: 因此，%lld 可以从该单元格中排除。

source: Therefore, %lld can be removed from any cell that sees all three cells in the pattern.
de: Daher kann %lld aus jeder Zelle entfernt werden, die alle drei Zellen des Musters sieht.
es: Por lo tanto, %lld puede eliminarse de cualquier celda que vea las tres celdas del patrón.
fr: Par conséquent, %lld peut être éliminé de n'importe quelle cellule qui voit les trois cellules du motif.
ja: 従って、%lld は、パターン内の3つのセルをすべて見ているどのセルからも 除去できる。
ko: 따라서 패턴에서 세 개의 셀을 모두 볼 수 있는 모든 셀에서 %lld를 제거할 수 있습니다.
zh_hans: 因此，%lld 可以从看到图案中所有三个单元格的任何单元格中去除。

source: Therefore, %lld can be removed from any cell that sees both wings.
de: Daher kann %lld aus jeder Zelle entfernt werden, die beide Flügel sieht.
es: Por lo tanto, %lld puede eliminarse de cualquier celda que vea ambas alas.
fr: Par conséquent, %lld peut être supprimé de toute cellule qui voit les deux ailes.
ja: したがって、どちらのウィングも見ることができるセルから%lldを削除できます。
ko: 따라서, %lld은(는) 두 윙을 모두 볼 수 있는 셀에서 제거할 수 있습니다.
zh_hans: 因此，%lld可以从任何能够看到两个翅膀的单元格中移除。

source: Therefore, %lld can be removed from any cell that sees both.
de: Deshalb kann %lld in allen Zellen, die beide sehen, entfernt werden.
es: Por lo tanto, %lld puede eliminarse de cualquier celda que vea ambas.
fr: Donc, %lld peut être supprimé de toute case qui voit les deux.
ja: したがって、どちらのセルも見えるセルからは %lld を除外できます。
ko: 따라서 두 칸 모두 볼 수 있는 칸에서는 %lld을(를) 제거할 수 있습니다.
zh_hans: 因此，%lld 可以从能同时看到这两个单元格的任意单元格中移除。

source: Therefore, this cell must be %lld.
de: Daher muss diese Zelle %lld sein.
es: Por lo tanto, esta celda debe ser %lld.
fr: Cette cellule doit donc être %lld.
ja: したがって、このセルは%lldでなければならない。
ko: 따라서 이 셀은 %lld여야 합니다.
zh_hans: 因此，这个单元格必须是 %lld。

source: These %1$@ digits (%2$@) must go in these %3$@ cells, though we don't know the exact arrangement yet.
de: Diese %1$@-Ziffern (%2$@) müssen in diese %3$@-Zellen passen, obwohl wir die genaue Anordnung noch nicht kennen.
es: Estos %1$@ dígitos (%2$@) deben ir en estas %3$@ celdas, aunque todavía no sabemos la disposición exacta.
fr: Ces %1$@ chiffres (%2$@) doivent être placés dans ces %3$@ cellules, bien que nous n'en connaissions pas encore l'agencement exact.
ja: これらの%1$@桁（%2$@）はこれらの%3$@セルに入れなければならないが、正確な配置はまだわかっていない。
ko: 이 %1$@ 숫자(%2$@)는 이 %3$@ 셀에 들어가야 하지만 아직 정확한 배열은 알 수 없습니다.
zh_hans: 这些 %1$@ 数字 (%2$@) 必须放在这些 %3$@ 单元格中，尽管我们还不知道具体的排列方式。

# These %lld's affect this %@
source: These %1$lld's affect this %2$@
de: Diese %1$lld's beeinflussen diese %2$@
es: Estos %1$lld's afectan a este %2$@
fr: Ces %1$lld's affectent ce %2$@
ja: これらの%1$lldはこの%2$@に影響を与える
ko: 이 %1$은 이 %2$@에 영향을 줍니다.
zh_hans: 这些 %1$lld 影响此 %2$@

source: These cells are connected by a strong link on digit %lld — it appears exactly twice in a shared unit.
de: Diese Zellen sind durch einen starken Link auf Ziffer %lld verbunden – sie kommt genau zweimal in einer gemeinsamen Einheit vor.
es: Estas celdas están conectadas por un enlace fuerte en el dígito %lld: aparece exactamente dos veces en una unidad compartida.
fr: Ces cases sont reliées par un lien fort sur le chiffre %lld — il apparaît exactement deux fois dans une unité partagée.
ja: これらのセルは数字%lldの強リンクでつながっています（共通ユニット上でちょうど2つ現れます）。
ko: 이 칸들은 숫자 %lld의 강한 연결로 연결되어 있습니다 — 이 공유 단위에서 정확히 두 번 나타납니다.
zh_hans: 这些格由%lld的强链连接——其在共享单位内仅出现两次。

source: These two cells form the 'roof' of the Skyscraper. One of these cells must contain %lld.
de: Diese beiden Zellen bilden das "Dach" des Wolkenkratzers. Eine dieser Zellen muss %lld enthalten.
es: Estas dos casillas forman el "tejado" del Rascacielos. Una de estas celdas debe contener %lld.
fr: Ces deux cellules forment le "toit" du gratte-ciel. L'une de ces cellules doit contenir %lld.
ja: この2つのセルは摩天楼の「屋根」を形成する。これらのセルの1つは%lldを含んでいなければならない。
ko: 이 두 셀은 스카이스크래퍼의 '지붕'을 형성합니다. 이 셀 중 하나에는 %lld가 포함되어야 합니다.
zh_hans: 这两个单元格构成了摩天大楼的 "屋顶"。其中一个单元格必须包含 %lld。

# This %lld affects this %@
source: This %1$lld affects this %2$@
de: Dies %1$würde dies %2$@ beeinflussen
es: Esto %1$lldfectaría a esto %2$@
fr: Ce %1$ pourrait affecter ce %2$@
ja: この %1$lld はこの %2$@ に影響する
ko: 이 %1$이 %2$@에 영향을 줄 수 있습니다.
zh_hans: 此 %1$lld 会影响此 %2$@

source: This cell only has one candidate
de: Diese Zelle hat nur einen Kandidaten
es: Esta casilla sólo tiene un candidato
fr: Cette cellule n'a qu'un seul candidat
ja: このセルには候補が一つしかない
ko: 이 셀에는 후보가 하나만 있습니다.
zh_hans: 该单元格只有一个候选数

# This means %@ cannot appear in any other cells in this %@.
source: This means %1$@ cannot appear in any other cells in this %2$@.
de: Das bedeutet, dass %1$@ in keiner anderen Zelle in diesem %2$@ vorkommen kann.
es: Esto significa que %1$@ no puede aparecer en ninguna otra casilla de este %2$@.
fr: Cela signifie que %1$@ ne peut apparaître dans aucune autre cellule de ce %2$@.
ja: つまり、%1$@はこの%2$@の中の他のどのセルにも現れない。
ko: 즉, %1$@은 이 %2$@의 다른 셀에 나타날 수 없습니다.
zh_hans: 这意味着 %1$@ 不能出现在此 %2$@ 中的任何其他单元格中。

# This means %lld must be placed in exactly %@ of these cells - one in each %@.
source: This means %1$lld must be placed in exactly %2$@ of these cells - one in each %3$@.
de: Das bedeutet, dass %1$lld in genau %2$@ dieser Zellen platziert werden muss - eine in jeder %3$@.
es: Esto significa que %1$lld debe colocarse exactamente en %2$@ de estas celdas - una en cada %3$@.
fr: Cela signifie que %1$lld doit être placé dans exactement %2$@ de ces cellules - une dans chaque %3$@.
ja: つまり、%1$lldは正確に%2$@のセルに置かなければならない。
ko: 즉, %3$@마다 하나씩 정확히 %2$@의 셀에 %1$lld를 배치해야 합니다.
zh_hans: 这意味着 %1$lld 必须恰好放在这些单元格的 %2$@ 中 - 每个 %3$@ 中一个。

source: This value is incorrect. The correct value is %lld.
de: Dieser Wert ist falsch. Der richtige Wert ist %lld.
es: Este valor es incorrecto. El valor correcto es %lld.
fr: Cette valeur est incorrecte. La valeur correcte est %lld.
ja: この値は正しくない。正しい値は %lld です。
ko: 이 값은 올바르지 않습니다. 올바른 값은 %lld입니다.
zh_hans: 此值不正确。正确的值是 %lld。

# We are missing a %lld in this %@.
source: We are missing a %1$lld in this %2$@.
de: Wir vermissen ein %1$lld in diesem %2$@.
es: Nos falta un %1$lld en este %2$@.
fr: Il nous manque un %1$lld dans ce %2$@.
ja: この %2$@ には %1$lld が欠けている。
ko: 이 %2$@에 %1$lld가 누락되었습니다.
zh_hans: 在这个 %2$@ 中，我们缺少一个 %1$lld。

source: We can rule out every other number by looking at the row, column, or box that affect this cell. Leaving %lld the only remaining option
de: Wir können jede andere Zahl ausschließen, indem wir uns die Zeile, die Spalte oder das Feld ansehen, die diese Zelle betreffen. Damit bleibt nur noch %lld als Option übrig
es: Podemos descartar cualquier otro número mirando la fila, columna o casilla que afectan a esta celda. Dejando %lld como única opción restante
fr: Nous pouvons exclure tous les autres nombres en examinant la ligne, la colonne ou la case qui affecte cette cellule. La seule option restante est %lld
ja: このセルに影響する行、列、ボックスを見ることで、他のすべての数字を除外することができる。残る選択肢は%lldだけである。
ko: 이 셀에 영향을 미치는 행, 열 또는 상자를 확인하여 다른 모든 숫자를 배제할 수 있습니다. 남은 옵션은 %lld만 남습니다.
zh_hans: 我们可以通过查看影响该单元格的行、列或方框来排除其他所有数字。剩下的选项只有 %lld

source: Wing A
de: Flügel A
es: Ala A
fr: Aile A
ja: ウィングA
ko: 윙 A
zh_hans: 翼 A

source: Wing B
de: Flügel B
es: Ala B
fr: Aile B
ja: ウィングB
ko: 윙 B
zh_hans: 翼 B

source: column
de: Spalte
es: columna
fr: colonne
ja: コラム
ko: 열
zh_hans: 列

source: columns
de: Spalten
es: columnas
fr: colonnes
ja: コラム
ko: 열
zh_hans: 列

source: four
de: vier
es: cuatro
fr: quatre
ja: 四
ko: 넷
zh_hans: 四

source: house
de: Haus
es: casa
fr: maison
ja: ハウス
ko: 집
zh_hans: 房屋

source: row
de: Zeile
es: fila
fr: rangée
ja: 行
ko: 행
zh_hans: 行

source: rows
de: Zeilen
es: filas
fr: rangées
ja: 行
ko: 행
zh_hans: 行数

source: three
de: drei
es: tres
fr: trois
ja: 三
ko: 셋
zh_hans: 三

source: two
de: zwei
es: dos
fr: deux
ja: 二
ko: 둘
zh_hans: 二

source: Jellyfish
es: Medusa
fr: Méduse
ja: ジェリーフィッシュ
ko: 젤리피쉬
zh_hans: 水母鱼

source: Swordfish
es: Pez espada
fr: Espadon
ja: ソードフィッシュ
ko: 소드피쉬
zh_hans: 剑鱼

source: X-Wing
fr: X-Aile
ja: Xウィング
ko: X-윙
zh_hans: X翼

source: XY-Wing
fr: Aile XY
ja: XYウィング
ko: XY-윙
zh_hans: XY翼

source: XYZ-Wing
fr: Aile XYZ
ja: XYZウィング
ko: XYZ-윙
zh_hans: XYZ翼

source: Y-Wing
fr: Aile Y
ja: Yウィング
ko: Y-윙
zh_hans: Y翼
